Merge pull request #62 from jwill824/017-task-rename-polish
017 task rename polish
